ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_ФактическиеОтгрузки/ЖБИ_ФактическиеОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЖБИ_ФактическиеОтгрузки</name>
  <comment>ЖБИ - Фактические отгрузки</comment>
  <registerRecords>AccumulationRegister.ЖБИ_ПередачаВОтгрузку</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПлательщика</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПеревозка</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантПеревозчик</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантДолжностьПеревозчик</name>
    <type>
      <types>CatalogRef.ЖБИ_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантОснованиеСоСтороныПеревозчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ЖБИ_Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьВодителя</name>
    <type>
      <types>CatalogRef.ЖБИ_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонВодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантЗаказчик</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтомобильГосударственныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтомобильМарка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйНомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаркаПрицепа</name>
    <type>
      <types>CatalogRef.ЖБИ_МаркаПрицепа</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаФрахта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументыПолучены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗагрузки</name>
    <type>
      <types>CatalogRef.ЖБИ_СпособЗагрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Товары</comment>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <comment>Номенклатура поставщика</comment>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена в счет с НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <comment>Поставщик</comment>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <comment>Контрагент</comment>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупатель</name>
      <comment>Покупатель</comment>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>План</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКОтгрузке</name>
      <comment>Кол-во к отгрузке</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтгружено</name>
      <comment>Кол-во отгружено факт</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <comment>Вес, т</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийВес</name>
      <comment>Общий вес, т</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтактныеЛицаПоставщика</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактныеЛицаПокупателя</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаАвто</name>
      <comment>Норма погрузки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРазмещенияВОтгрузку</name>
      <comment>Дата размещения в отгрузку</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <comment>Дата отгрузки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МенеджерОС</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительнаяИнформация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Негабаритный</name>
      <comment>Не габарит</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаПокупателя</name>
      <type>
        <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
      </type>
    </attributes>
    <attributes>
      <name>ПередачаВОтгрузку</name>
      <type>
        <types>DocumentRef.ЖБИ_ПередачаВОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктОтгрузки</name>
      <comment>Пункт отгрузки</comment>
      <type>
        <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктНазначения</name>
      <comment>Пункт назначения</comment>
      <type>
        <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОтгрузки</name>
    <comment>Документы</comment>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОтгрузки</name>
      <comment>Документы</comment>
      <type>
        <types>DocumentRef.ЖБИ_ДоговорЗаявка</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ТранспортнаяНакладная</types>
        <types>DocumentRef.ДоверенностьВыданная</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <comment>Поставщик</comment>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаПокупателя</name>
      <type>
        <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_ФактическиеОтгрузки/Forms/ФормаФактическиеОтгрузки/Module.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

#Область Печать

&НаСервере
Функция ПолучитьСписокПечатныхФорм()
	
	СтруктураПечатныхФорм = Новый Структура;	
	Возврат СтруктураПечатныхФорм;
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	 
	ТекДанные = ЖБИ_ОбщийМодульКлиентСервер.ПроверитьТекСтрокуНаДоступность(ЭтаФорма,"Список");
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	 
	ИмяФормыПечати 	= СтрЗаменить(Команда.Имя, "Печать_", "");
	ОбъектПечати 	= ТекДанные.Ссылка; 
	Если НЕ ЗначениеЗаполнено(ОбъектПечати) Тогда 
		Возврат;
	КонецЕсли;	

	МассивПечатныхФорм 	= ПечатьСерверный(ИмяФормыПечати,ОбъектПечати);
	Если ЗначениеЗаполнено(МассивПечатныхФорм) Тогда
		ЖБИ_ОбщийМодульКлиентСервер.СформироватьПечатнуюФорму(ЭтаФорма,МассивПечатныхФорм);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПечатьСерверный(ИмяФормыПечати, ОбъектПечати)
	
	МассивПечатныхФорм = Новый Массив;
	
	КоллекцияПечатныхФорм 	= Новый ТаблицаЗначений;
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");	
	КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ");
	
	ПараметрыПечати 		= Новый Структура("ДополнитьКомплектВнешнимиПечатнымиФормами",Ложь);
	МассивОбъектов			= Новый Массив;
	МассивОбъектов.Добавить(ОбъектПечати);
	НоваяСтр 				= КоллекцияПечатныхФорм.Добавить();
	НоваяСтр.ИмяВРЕГ		= ВРЕГ(ИмяФормыПечати);
	НоваяСтр.ИмяМакета      = ИмяФормыПечати;
	Документы.ЖБИ_ФактическиеОтгрузки.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, Новый СписокЗначений, Новый Структура, МассивПечатныхФорм);

	Возврат МассивПечатныхФорм;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ОбработатьАктивизациюСтрокиСписка()
	
	ТекДанные = ЖБИ_ОбщийМодульКлиентСервер.ПроверитьТекСтрокуНаДоступность(ЭтаФорма,"Список");
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяОперации()
	
	ИмяОперации = "";
	ИмяСтраницы = Элементы.СтраницыОсновнаяФорма.ТекущаяСтраница.Имя;	
	Если ИмяСтраницы = "СтраницаДокументов" Тогда
		ИмяОперации = "СтраницаДокументов";
		Элементы.КомандаДокументы.Пометка = Истина;
	КонецЕсли;
	
	Возврат ИмяОперации;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПараметрыДинамическогоСписка()
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоУмолчаниюДинамическогоСписка()
	
	ОтборМенеджер = ТекущийПользователь;
	УстановитьОтборДинамическогоСпискаПоЭлементу(Элементы.ОтборМенеджер, "Менеджер",Неопределено);	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДинамическогоСпискаПоЭлементу(Элемент,ИмяОтбора,ВидСравнения)
	
	Если ЗначениеЗаполнено(ЭтотОбъект[Элемент.Имя]) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, ИмяОтбора, ЭтотОбъект[Элемент.Имя], ВидСравнения, , );
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список,ИмяОтбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинСпискаПоСегменту(СписокСегмент, ИмяОтбора, ВидСравнения)	
	ЖБИ_ОбщийМодульОтчетыИОбработки.УстановитьОтборДинСпискаПоСегменту(СписокСегмент,Список,ИмяОтбора,ВидСравнения);	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

#Область Команды

&НаКлиенте
Процедура КомандаИзменитьФактическиеОтгрузки(Команда)
	
	ТекДанные = ЖБИ_ОбщийМодульКлиентСервер.ПроверитьТекСтрокуНаДоступность(ЭтаФорма,"Список");
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЖБИ_ФактическиеОтгрузки.Форма.ФормаДокумента",
	Новый Структура("Ключ",ТекДанные.Ссылка),
	ЭтаФорма,,,,
	Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтаФорма, "КомандаИзменитьФактическиеОтгрузки"));
	
КонецПроцедуры

#КонецОбласти

#Область Отборы

&НаКлиенте
Процедура ДатаОтгрузкиОтборПриИзменении(Элемент)
	УстановитьОтборДинамическогоСпискаПоЭлементу(Элемент, "ДатаОтгрузки",Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикОтборПриИзменении(Элемент)
	УстановитьОтборДинамическогоСпискаПоЭлементу(Элемент, "Перевозчик",Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыгрузкиОтборПриИзменении(Элемент)
	УстановитьОтборДинамическогоСпискаПоЭлементу(Элемент, "ДатаВыгрузки",Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВодительОтборПриИзменении(Элемент)
	УстановитьОтборДинамическогоСпискаПоЭлементу(Элемент, "Водитель",Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикОтборПриИзменении(Элемент)
	УстановитьОтборДинамическогоСпискаПоЭлементу(Элемент, "Поставщик",Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОтборСегментПриИзменении(Элемент)	
	УстановитьОтборДинСпискаПоСегменту(ЭтотОбъект[Элемент.Имя], "Поставщик", ВидСравненияКомпоновкиДанных.ВСписке);	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОтборПриИзменении(Элемент)
	УстановитьОтборДинамическогоСпискаПоЭлементу(Элемент, "Номенклатура",Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПокупательОтборПриИзменении(Элемент)
	УстановитьОтборДинамическогоСпискаПоЭлементу(Элемент, "Покупатель",Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОтборПриИзменении(Элемент)
	УстановитьОтборДинамическогоСпискаПоЭлементу(Элемент, "Организация",Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПунктНазначенияОтборПриИзменении(Элемент)
	УстановитьОтборДинамическогоСпискаПоЭлементу(Элемент, "ПунктНазначения",Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура АвторОтборПриИзменении(Элемент)
	УстановитьОтборДинамическогоСпискаПоЭлементу(Элемент, "Автор",Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОтборМенеджерПриИзменении(Элемент)
	УстановитьОтборДинамическогоСпискаПоЭлементу(Элемент, "Менеджер",Неопределено);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Список

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КомандаИзменитьФактическиеОтгрузки("");		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Для Каждого Строка Из Строки Цикл
		Данные 								= Строка.Значение.Данные;		
		Данные.ДоговорЗаявкаПредставдение 	= СокрЛП(Данные.ДоговорПеревозчик.Номер) + "-" + СокрЛП(Данные.ДоговорЗаявки.НомерЗаявки);	
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(ЭтаФорма.Параметры) = Тип("ДанныеФормыСтруктура") Тогда
		Для Каждого Реквизит Из ЭтаФорма.ПолучитьРеквизиты() Цикл
			Если ЭтаФорма.Параметры.Свойство(Реквизит.Имя) Тогда
				ЭтаФорма[Реквизит.Имя] = ЭтаФорма.Параметры[Реквизит.Имя];
			КонецЕсли;	
		КонецЦикла;	
	Иначе
		Возврат;
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ЖБИ_ОбщийМодульКлиентСервер.УстановитьКнопкиПечатиСервер(ПолучитьСписокПечатныхФорм(),ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	УстановитьДоступностьЭлементовФормы();
	Элементы.СтраницыОсновнаяФорма.ТекущаяСтраница = Элементы.СтраницаДокументов;
	ИмяОперации = ПолучитьИмяОперации();
	
	УстановитьПараметрыДинамическогоСписка();
	УстановитьОтборПоУмолчаниюДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатВыполнения = Новый Структура("СообщениеОбОшибке","");	
	Если Результат = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда 
			
	КонецЕсли;	
	
	Если ДополнительныеПараметры = "КомандаИзменитьФактическиеОтгрузки" Тогда
		Элементы.Список.Обновить();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
